<template>
  <svg width="16px" height="16px" viewBox="0 0 16 16" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
    <title>icon/home</title>
    <g id="款与发票" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
      <g id="进账已分配" transform="translate(-24, -140.3129)" fill="#000000" fill-rule="nonzero">
        <g id="订单列表" transform="translate(11, 128)">
          <g id="icon/home" transform="translate(13, 12.3129)">
            <rect id="矩形" opacity="0" x="0" y="0" width="16" height="16"></rect>
            <g id="home-filled" fill-opacity="1">
              <rect id="矩形" opacity="0" x="0" y="0" width="16" height="16"></rect>
              <path d="M14.7890625,7.890625 L8.353125,1.459375 C8.1578125,1.2640625 7.8421875,1.2640625 7.646875,1.459375 L1.2109375,7.890625 C1.0234375,8.078125 0.9171875,8.3328125 0.9171875,8.5984375 C0.9171875,9.15 1.365625,9.5984375 1.9171875,9.5984375 L2.5953125,9.5984375 L2.5953125,14.1875 C2.5953125,14.4640625 2.81875,14.6875 3.0953125,14.6875 L7,14.6875 L7,11.1875 L8.75,11.1875 L8.75,14.6875 L12.9046875,14.6875 C13.18125,14.6875 13.4046875,14.4640625 13.4046875,14.1875 L13.4046875,9.5984375 L14.0828125,9.5984375 C14.3484375,9.5984375 14.603125,9.49375 14.790625,9.3046875 C15.1796875,8.9140625 15.1796875,8.28125 14.7890625,7.890625 L14.7890625,7.890625 Z" id="路径"></path>
            </g>
          </g>
        </g>
      </g>
    </g>
  </svg>
</template>
